posts/2020-08-20-exwm.org
#+title: Exwm
#+date: <2020-08-20 16:06>
#+description: Emacs windows manager
#+filetags: emacs

EXWM (Emacs X Window Manager) es un completo gestor de ventanas X en mosaico para Emacs construido sobre XELB.

*** #Instalación

Para instalar Exwm y todas sus dependencias...

#+BEGIN_SRC 
M-x package-install RET exwm RET.
#+END_SRC

*** #Inicio .xinitrc y init.el

+ Para poder iniciarlo creo (o lo copio desde */etc/X11/xinitrc*) el archivo .xinitrc en el directorio /home con el siguiente contenido:

dejo aqui mi .xinitrc con ejemplos a modo de buckup

#+BEGIN_SRC 
#!/usr/bin/env bash
#
# This is a sample file for the ~/.xinitrc file.
#

# You may need to comment out the next line to disable access control
#xhost +

# Set themes, etc
#gnome-settings-daemon &

# Set fallback cursor
xsetroot -cursor_name left_ptr

# If Emacs is started in server mode, `emacsclient` is a convenient way to edit
# files in place (used by e.g. `git commit`)
export VISUAL=emacsclient
export EDITOR="$VISUAL"

# Disable access control
xhost +SI:localuser:$USER

## Over-rides
#
xset b off &
#numlockx off                    # Turn off numlock

# Set keyboard repeat rate
xset r rate 300 40

# Set capslock as ctrl
#setxkbmap -layout us -option ctrl:nocaps
sudo setxkbmap -layout 'es,es' -model pc105

# Programs to start upon startup
#volumeicon &
#transmission-daemon &
#/usr/bin/hexo-server.sh &
xmobar .config/xmobar/xmobar.config &
#xfce4-power-manager &
#syncthing -no-browser &         # Syncthing
#nm-applet &                     # Network Manager
#pasystray &                     # Pulseaudio volume control from tray
#udiskie --tray &                # Disk mount utility

# launch emacs upon startup
#exec openbox/session
exec dbus-launch --exit-with-session emacs
#+END_SRC

+ luego le agredo los permisos 774 a este archivo 
+ creo un enlace simbolico a ~/.xinitrc llamado ~/.xsession o ~/.xsessionrc

*nota*
Crear el enlace simbolico ~/.xsession da la posibilidad de instalar otro administrador de ventanas como openbox o xfce. Crear el enlace a ~/.xsessionrc permite iniciar directamente con *exwm*.

+ por último en el *init.el* agrego:

#+BEGIN_SRC
(add-to-list 'load-path "~/.emacs.d/xelb/")
(add-to-list 'load-path "~/.emacs.d/elpa/exwm-0.24/")
(require 'exwm)
(require 'exwm-config)
(exwm-config-default)
(exwm-enable)
(setq exwm-workspace-minibuffer-position (quote bottom))
(setq exwm-workspace-number 10)
#+END_SRC

*** # Atajo de teclado 


