2020-08-20-exwm.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta name="description" content="Emacs windows manager" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/rss.xml"
      title="RSS feed for https://martiyo.github.io/"
    />
    <title>Exwm</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/">/home</a></li>
          <li><a href="https://martiyo.github.io/about">/about</a></li>
          <li><a href="https://martiyo.github.io/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Search..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">20 ago 2020</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/2020-08-20-exwm.html">Exwm</a>
      </h1>
      <p>
        EXWM (Emacs X Window Manager) es un completo gestor de ventanas X en
        mosaico para Emacs construido sobre XELB.
      </p>

      <div id="outline-container-org547cb8d" class="outline-2">
        <h2 id="org547cb8d">#Instalación</h2>
        <div class="outline-text-2" id="text-org547cb8d">
          <p>Para instalar Exwm y todas sus dependencias&#x2026;</p>

          <pre class="example">
M-x package-install RET exwm RET.
</pre
          >
        </div>
      </div>

      <div id="outline-container-org83aa25b" class="outline-2">
        <h2 id="org83aa25b">#Inicio .xinitrc y init.el</h2>
        <div class="outline-text-2" id="text-org83aa25b">
          <ul class="org-ul">
            <li>
              Para poder iniciarlo creo (o lo copio desde
              <b>/etc/X11/xinitrc</b>) el archivo .xinitrc en el directorio
              /home con el siguiente contenido:
            </li>
          </ul>

          <p>dejo aqui mi .xinitrc con ejemplos a modo de buckup</p>

          <pre class="example">
#!/usr/bin/env bash
#
# This is a sample file for the ~/.xinitrc file.
#

# You may need to comment out the next line to disable access control
#xhost +

# Set themes, etc
#gnome-settings-daemon &amp;

# Set fallback cursor
xsetroot -cursor_name left_ptr

# If Emacs is started in server mode, `emacsclient` is a convenient way to edit
# files in place (used by e.g. `git commit`)
export VISUAL=emacsclient
export EDITOR="$VISUAL"

# Disable access control
xhost +SI:localuser:$USER

## Over-rides
#
xset b off &amp;
#numlockx off                    # Turn off numlock

# Set keyboard repeat rate
xset r rate 300 40

# Set capslock as ctrl
#setxkbmap -layout us -option ctrl:nocaps
sudo setxkbmap -layout 'es,es' -model pc105

# Programs to start upon startup
#volumeicon &amp;
#transmission-daemon &amp;
#/usr/bin/hexo-server.sh &amp;
xmobar .config/xmobar/xmobar.config &amp;
#xfce4-power-manager &amp;
#syncthing -no-browser &amp;         # Syncthing
#nm-applet &amp;                     # Network Manager
#pasystray &amp;                     # Pulseaudio volume control from tray
#udiskie --tray &amp;                # Disk mount utility

# launch emacs upon startup
#exec openbox/session
exec dbus-launch --exit-with-session emacs
</pre
          >

          <ul class="org-ul">
            <li>luego le agredo los permisos 774 a este archivo</li>
            <li>
              creo un enlace simbolico a ~/.xinitrc llamado ~/.xsession o
              ~/.xsessionrc
            </li>
          </ul>

          <p>
            <b>nota</b>
            Crear el enlace simbolico ~/.xsession da la posibilidad de instalar
            otro administrador de ventanas como openbox o xfce. Crear el enlace
            a ~/.xsessionrc permite iniciar directamente con <b>exwm</b>.
          </p>

          <ul class="org-ul">
            <li>por último en el <b>init.el</b> agrego:</li>
          </ul>

          <pre class="example">
(add-to-list 'load-path "~/.emacs.d/xelb/")
(add-to-list 'load-path "~/.emacs.d/elpa/exwm-0.24/")
(require 'exwm)
(require 'exwm-config)
(exwm-config-default)
(exwm-enable)
(setq exwm-workspace-minibuffer-position (quote bottom))
(setq exwm-workspace-number 10)
</pre
          >
        </div>
      </div>

      <div id="outline-container-org9bbdc22" class="outline-2">
        <h2 id="org9bbdc22"># Atajo de teclado</h2>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/tag-emacs.html">emacs</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
